OpenFOAM/problems/cylinder/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
22000
(
(1.0000002346969 -1.7685865059705e-05 0)
(1.0000172680857 -5.2111371322641e-05 0)
(1.0000510148196 -8.7646634827069e-05 0)
(1.0001018087968 -0.00012269727268411 0)
(1.0001703178594 -0.00015805082214877 0)
(1.0002562285597 -0.00019407186793279 0)
(1.0003590068564 -0.00022900095323204 0)
(1.0004793131495 -0.00026454343594 0)
...
)
;

boundaryField
{
    cylinder
    {
        type            rotatingWallVelocity;
        origin          (5 7.5 0);
        axis            (0 0 1);
        omega           tableFile;
        omegaCoeffs
        {
            file            "$FOAM_CASE/control0";
        }
    }
    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    symUp
    {
        type            slip;
    }
    symDown
    {
        type            slip;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
