OpenFOAM/problems/cylinder/0/dU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volTensorField;
    location    "0.1";
    object      dU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];


internalField   nonuniform List<tensor> 
22000
(
(9.1201493485333e-05 -0.00036369143909956 0 -1.484958262477e-07 -8.8748680353005e-05 0 0 0 0)
(0.00026459924268283 -0.00036454356011792 0 -8.2923225500815e-09 -0.00026478484114112 0 0 0 0)
(0.00044051504749241 -0.00036780092417419 0 6.6476455500551e-07 -0.00044336584782502 0 0 0 0)
(0.000621650605445 -0.00036685406948437 0 2.016076516535e-06 -0.00062354717639951 0 0 0 0)
(0.00080463280069953 -0.00037191055988194 0 3.1804308346537e-06 -0.00080326006893256 0 0 0 0)
(0.00098319899753983 -0.00036969881066043 0 4.2067108691221e-06 -0.00098464967410785 0 0 0 0)
(0.0011624236098756 -0.00036720516903712 0 7.2276424707339e-06 -0.0011635164510828 0 0 0 0)
(0.001344213522509 -0.00036837816027558 0 1.010102623271e-05 -0.0013440343863565 0 0 0 0)
...
)
;

boundaryField
{
    cylinder
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
200
(
(-14.760582718522 16.425224905038 2.2065134233567e-19 -15.860213451344 15.395570651506 -2.2783666582004e-19 0 0 0)
(-14.479973044527 16.990859228686 3.5397792827832e-20 -14.785750703896 15.142010439756 2.469932697453e-19 -1.104416858233e-17 1.3050121504659e-17 -3.32962936256e-38)
(-14.116476237415 17.47148817229 -2.7705879678116e-19 -13.700146148486 14.793082936207 -8.5551083277425e-20 1.6944219886403e-17 -1.9197745537039e-17 3.1081629305993e-38)
(-13.671211799057 17.854578732119 9.9328272213159e-20 -12.615965802366 14.35750400314 -1.2405151487928e-19 0 0 0)
(-13.152021041761 18.133896318828 0 -11.543448512043 13.842422410693 0 0 0 0)
(-12.565714812328 18.302749174265 -4.3336274928625e-24 -10.492866487703 13.256574704184 6.1693829902263e-24 0 0 0)
(-11.92013538646 18.355446785943 2.7422954849481e-19 -9.4732213588024 12.60919200336 -4.1768892123862e-19 0 0 0)
(-11.223664927783 18.287232101351 8.1421140834569e-19 -8.4924264313128 11.909941310923 2.7345767827305e-19 3.09462133366e-18 -3.8782604440881e-18 -1.037140232106e-37)
...
)
;
    }
    inlet
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
100
(
(4.8917272728968e-06 -0.0003686219139132 0 -1.484958262477e-07 -8.8748680353005e-05 0 0 0 0)
(2.514530976416e-06 -0.0010728010092119 0 -1.9779862210526e-07 -8.9466694029693e-05 0 0 0 0)
(1.7695648723499e-06 -0.001759987754589 0 1.7270112378488e-07 -9.2236526990851e-05 0 0 0 0)
(4.935775288673e-06 -0.0024268432473617 0 -3.7465131213003e-08 -9.5490441545253e-05 0 0 0 0)
(1.4429339278748e-06 -0.0030828595929294 0 -2.637388997602e-07 -9.9431145565011e-05 0 0 0 0)
(1.3886813955324e-06 -0.0037270307222248 0 -6.3954319069188e-08 -0.0001031628375955 0 0 0 0)
(6.7289577066859e-07 -0.0043562283871157 0 -2.4227269162602e-07 -0.00010632260082431 0 0 0 0)
(-1.3939523311987e-06 -0.0049658872650039 0 -9.7372312964847e-08 -0.00010875667456579 0 0 0 0)
...
)
;
    }
    outlet
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
100
(
(0 0 0 0.00037371521940737 -0.0043573812357272 0 0 0 0)
(0 0 0 0.0011068364316171 -0.0043577233075195 0 0 0 0)
(0 0 0 0.0018186531024128 -0.004366471898122 0 0 0 0)
(0 0 0 0.0025170065500387 -0.0043731393857546 0 0 0 0)
(0 0 0 0.003219803941312 -0.0043540026308629 0 0 0 0)
(0 0 0 0.0039332109164773 -0.0042798823471389 0 0 0 0)
(0 0 0 0.0046333707262928 -0.0041428690887726 0 0 0 0)
(0 0 0 0.0053012761849851 -0.0039141149847143 0 0 0 0)
...
)
;
    }
    symUp
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
155
(
(5.6690328636666e-05 0.00027052437296227 0 0 -5.4678573943983e-05 0 0 0 0)
(0.00016598338836209 0.00027168568311011 0 0 -0.00016691589386123 0 0 0 0)
(0.00027907586665717 0.00027379608211311 0 0 -0.00027722430503588 0 0 0 0)
(0.00039118864465606 0.00027443658868848 0 0 -0.00039119031482668 0 0 0 0)
(0.00050604346409615 0.0002720623800375 0 0 -0.00050202338376911 0 0 0 0)
(0.00061829115940182 0.0002749981796911 0 0 -0.00061404460944721 0 0 0 0)
(0.0007338419008207 0.00027692517419953 0 0 -0.00072728247820437 0 0 0 0)
(0.0008474882000187 0.00027656910130357 0 0 -0.00084088216174149 0 0 0 0)
...
)
;
    }
    symDown
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
155
(
(9.1201493485333e-05 -0.00036369143909956 0 0 -8.952174277355e-05 0 0 0 0)
(0.00026459924268283 -0.00036454356011792 0 0 -0.00026377566284565 0 0 0 0)
(0.00044051504749241 -0.00036780092417419 0 0 -0.00044364691641987 0 0 0 0)
(0.000621650605445 -0.00036685406948437 0 0 -0.0006210651074834 0 0 0 0)
(0.00080463280069953 -0.00037191055988194 0 0 -0.00080001656677723 0 0 0 0)
(0.00098319899753983 -0.00036969881066043 0 0 -0.0009823467374658 0 0 0 0)
(0.0011624236098756 -0.00036720516903712 0 0 -0.0011591496577029 0 0 0 0)
(0.001344213522509 -0.00036837816027558 0 0 -0.0013390574532093 0 0 0 0)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
