OpenFOAM/problems/cylinder/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
dimensions      [0 2 -2 0 0 0 0];
internalField   nonuniform List<scalar> 
22000
(
0.057228
0.057211
0.057179
0.057129
0.057062
0.056979
0.056878
0.056760
...
)
;
boundaryField
{
    cylinder
    {
        type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    symUp
    {
        type            slip;
    }
    symDown
    {
        type            slip;
    }
    frontAndBack
    {
        type            empty;
    }
}
