OpenFOAM/problems/cylinder/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];
oriented        oriented;


internalField   nonuniform List<scalar> 
43645
(
0.39512222992691
-3.3568819624255e-06
0.39513225653703
-1.0026632559109e-05
0.39514904899148
-1.6792478703648e-05
0.39517267528249
-2.3626316088669e-05
...
)
;

boundaryField
{
    cylinder
    {
        type            calculated;
        value           uniform 0;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
-0.395118873064
-0.372942554741
-0.352010897525
-0.33225404396
-0.31360605738
-0.29600470186
-0.27939123452
-0.26371020945
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
0.4136549432243
0.39054495570653
0.36881251341663
0.34835967879709
0.329097337752
0.31094813480402
0.29383949526078
0.27770232118439
...
)
;
    }
    symUp
    {
        type            calculated;
        value           uniform 0;
    }
    symDown
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
        value           nonuniform 0();
    }
}


// ************************************************************************* //
